<a href="https://colab.research.google.com/github/hyelin606/mulcamp34/blob/main/240105_pandas_test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## (1) 라이브러리 불러오기
- numpy, pandas, seaborn 라이브러리를 불러온다.

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

# 각 라이브러리 버전 확인
print(f'NumPy Version: {np.__version__}')

NumPy Version: 1.26.2

## (2) 데이터 불러오기
- tips 데이터를 불러와서 tips라고 저장한다.

In [ ]:
# sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [ ]:
# sns.get_dataset_names()
tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

## (3) 특정 행 추출
- loc을 사용하여 tips 데이터셋의 처음 3행의 데이터를 추출하세요.

In [ ]:
# loc와 iloc 차이점
loc에 l은 무엇을 의미할까요? # Label 기반

iloc에서 i는 무엇을 의미할까요? # index 기반

SyntaxError: invalid syntax (1147616125.py, line 2)

In [ ]:
# tips.head(3)
tips.loc[0:2, :]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [ ]:
tips.iloc[0:3, :]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

## (4) 특정 열 추출
- loc을 사용하여 모든 레코드에 대한 'total_bill'과 'tip' 열을 추출하세요.

In [ ]:
tips.loc[:, ['total_bill', 'tip']].head(1)

   total_bill   tip
0       16.99  1.01

## (5) 특정 행과 열의 조합
- loc을 사용하여 처음 5행에 대해 'total_bill', 'tip', 'day' 열을 추출하세요.

In [ ]:
tips.loc[0:4, ['total_bill', 'tip', 'day']]

   total_bill   tip  day
0       16.99  1.01  Sun
1       10.34  1.66  Sun
2       21.01  3.50  Sun
3       23.68  3.31  Sun
4       24.59  3.61  Sun

## (6) 조건에 따른 행 추출
- 'day'가 'Sunday'인 모든 행을 추출하고 'total_bill'과 'tip' 열만 표시하세요.

In [ ]:
tips.loc[tips['day'] == 'Sun', ['total_bill', 'tip']]

     total_bill   tip  day
0         16.99  1.01  Sun
1         10.34  1.66  Sun
2         21.01  3.50  Sun
3         23.68  3.31  Sun
4         24.59  3.61  Sun
..          ...   ...  ...
186       20.90  3.50  Sun
187       30.46  2.00  Sun
188       18.15  3.50  Sun
189       23.10  4.00  Sun
190       15.69  1.50  Sun

[76 rows x 3 columns]

## (7) 다중 조건에 따른 행 추출
- loc을 사용하여 'time'이 'Dinner'이고 'tip'이 5달러 이상인 모든 행을 선택하고 'total_bill', 'sex', 'smoker' 열만 표시하세요.

In [ ]:
tips.loc[tips['time'] == 'Dinner', :].head(1) # 이 코드부터 수정 및 확인

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

In [ ]:
# tips.loc[() & (), ['total_bill', 'sex', 'smoker']].head(1)
result = tips.loc[(tips['time'] == 'Dinner') & (tips['tip'] >= 5), ['total_bill', 'sex', 'smoker', 'tip']].reset_index(drop=True)
# tips.loc[tips['time'] == 'Dinner' & tips['tip'] >= 5, :]
result.head(5)

   total_bill     sex smoker   tip
0       35.26  Female     No  5.00
1       39.42    Male     No  7.58
2       31.27    Male     No  5.00
3       30.40    Male     No  5.60
4       22.23    Male     No  5.00

In [ ]:
result.reset_index(drop=True)

    total_bill     sex smoker    tip
0        35.26  Female     No   5.00
1        39.42    Male     No   7.58
2        31.27    Male     No   5.00
3        30.40    Male     No   5.60
4        22.23    Male     No   5.00
5        32.40    Male     No   6.00
6        34.81  Female     No   5.20
7        48.27    Male     No   6.73
8        25.28  Female    Yes   5.00
9        29.93    Male     No   5.07
10       29.85  Female     No   5.14
11       48.17    Male     No   5.00
12       50.81    Male    Yes  10.00
13        7.25    Male    Yes   5.15
14       23.33    Male    Yes   5.65
15       23.17    Male    Yes   6.50
16       20.69    Male     No   5.00
17       25.89    Male    Yes   5.16
18       48.33    Male     No   9.00
19       28.17  Female    Yes   6.50
20       29.03    Male     No   5.92